In [38]:
# import dependencies
import pandas as pd

In [39]:
# Define a function that reads a text file with two columns and stores it in a dictionary.
def read_file_to_dict(file_path):
    """
    Reads a text file with two columns and stores it in a dictionary.
    
    Args:
    file_path (str): The path to the text file.
    
    Returns:
    dict: A dictionary with keys from the first column and values from the second column.
    """
    data_dict = {}
    
    with open(file_path, 'r') as file:
        for line in file:
            # Strip leading/trailing whitespace and split by whitespace
            parts = line.strip().split(maxsplit=1)
            if len(parts) == 2:
                key, value = parts
                data_dict[key] = value
    
    return data_dict

In [40]:
#Use the function to read the state  data into dictionaries.

state_dict = read_file_to_dict('resources/state_codes.txt')
print(state_dict)

{'state-level': 'place', 'FIPS': 'code     name', '-----------': '-------', '01': 'ALABAMA', '02': 'ALASKA', '04': 'ARIZONA', '05': 'ARKANSAS', '06': 'CALIFORNIA', '08': 'COLORADO', '09': 'CONNECTICUT', '10': 'DELAWARE', '11': 'DISTRICT OF COLUMBIA', '12': 'FLORIDA', '13': 'GEORGIA', '15': 'HAWAII', '16': 'IDAHO', '17': 'ILLINOIS', '18': 'INDIANA', '19': 'IOWA', '20': 'KANSAS', '21': 'KENTUCKY', '22': 'LOUISIANA', '23': 'MAINE', '24': 'MARYLAND', '25': 'MASSACHUSETTS', '26': 'MICHIGAN', '27': 'MINNESOTA', '28': 'MISSISSIPPI', '29': 'MISSOURI', '30': 'MONTANA', '31': 'NEBRASKA', '32': 'NEVADA', '33': 'NEW HAMPSHIRE', '34': 'NEW JERSEY', '35': 'NEW MEXICO', '36': 'NEW YORK', '37': 'NORTH CAROLINA', '38': 'NORTH DAKOTA', '39': 'OHIO', '40': 'OKLAHOMA', '41': 'OREGON', '42': 'PENNSYLVANIA', '44': 'RHODE ISLAND', '45': 'SOUTH CAROLINA', '46': 'SOUTH DAKOTA', '47': 'TENNESSEE', '48': 'TEXAS', '49': 'UTAH', '50': 'VERMONT', '51': 'VIRGINIA', '53': 'WASHINGTON', '54': 'WEST VIRGINIA', '55': 'WISCONSIN', '56': 'WYOMING'}

In [41]:
# for key in state_dict: if key begins with 0, then the '0' should not be used for mapping the state code to the state name.
# Create a new dictionary with the correct state codes.
state_dict_new = {}
for key, value in state_dict.items():
    if key[0] == '0':
        state_dict_new[key[1:]] = value
    else:
        state_dict_new[key] = value 
display(state_dict_new)

{'state-level': 'place',
 'FIPS': 'code     name',
 '-----------': '-------',
 '1': 'ALABAMA',
 '2': 'ALASKA',
 '4': 'ARIZONA',
 '5': 'ARKANSAS',
 '6': 'CALIFORNIA',
 '8': 'COLORADO',
 '9': 'CONNECTICUT',
 '10': 'DELAWARE',
 '11': 'DISTRICT OF COLUMBIA',
 '12': 'FLORIDA',
 '13': 'GEORGIA',
 '15': 'HAWAII',
 '16': 'IDAHO',
 '17': 'ILLINOIS',
 '18': 'INDIANA',
 '19': 'IOWA',
 '20': 'KANSAS',
 '21': 'KENTUCKY',
 '22': 'LOUISIANA',
 '23': 'MAINE',
 '24': 'MARYLAND',
 '25': 'MASSACHUSETTS',
 '26': 'MICHIGAN',
 '27': 'MINNESOTA',
 '28': 'MISSISSIPPI',
 '29': 'MISSOURI',
 '30': 'MONTANA',
 '31': 'NEBRASKA',
 '32': 'NEVADA',
 '33': 'NEW HAMPSHIRE',
 '34': 'NEW JERSEY',
 '35': 'NEW MEXICO',
 '36': 'NEW YORK',
 '37': 'NORTH CAROLINA',
 '38': 'NORTH DAKOTA',
 '39': 'OHIO',
 '40': 'OKLAHOMA',
 '41': 'OREGON',
 '42': 'PENNSYLVANIA',
 '44': 'RHODE ISLAND',
 '45': 'SOUTH CAROLINA',
 '46': 'SOUTH DAKOTA',
 '47': 'TENNESSEE',
 '48': 'TEXAS',
 '49': 'UTAH',
 '50': 'VERMONT',
 '51': 'VIRGINIA',
 '53': 'WASHINGTON',
 '54': 'WEST VIRGINIA',
 '55': 'WISCONSIN',
 '56': 'WYOMING'}

In [42]:
# Read the birth data from csv file and store it in a dataframe
birth_data_df = pd.read_csv('resources/allBirthData.csv')
display(birth_data_df.head())
display(birth_data_df.tail())
birth_data_df.info()

   index  Unnamed: 0  State  Month  Year  countyBirths  stateBirths  County
0      0           1      1      1  1985          36.0         5027  1001.0
1      1           2      1      2  1985          36.0         4627  1001.0
2      2           3      1      3  1985          43.0         4738  1001.0
3      3           4      1      4  1985          40.0         4626  1001.0
4      4           5      1      5  1985          34.0         4834  1001.0

,index,Unnamed: 0,State,Month,Year,countyBirths,stateBirths,County
321470,321470,321471,55,12,2015,111.0,5632,55131.0
321471,321471,321472,55,12,2015,307.0,5632,55133.0
321472,321472,321473,55,12,2015,154.0,5632,55139.0
321473,321473,321474,55,12,2015,1848.0,5632,55999.0
321474,321474,321475,56,12,2015,661.0,661,56999.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 321475 entries, 0 to 321474
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   index         321475 non-null  int64
 1   Unnamed: 0    321475 non-null  int64
 2   State         321475 non-null  int64
 3   Month         321475 non-null  int64
 4   Year          321475 non-null  int64
 5   countyBirths  293021 non-null  float64
 6   stateBirths   321475 non-null  int64
 7   County        312919 non-null  float64
dtypes: float64(2), int64(6)
memory usage: 19.6 MB

In [43]:
# convert the state and county columns to strings
birth_data_df['State'] = birth_data_df['State'].astype(str)
birth_data_df['County'] = birth_data_df['County'].astype(str)
birth_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 321475 entries, 0 to 321474
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   index         321475 non-null  int64
 1   Unnamed: 0    321475 non-null  int64
 2   State         321475 non-null  object
 3   Month         321475 non-null  int64
 4   Year          321475 non-null  int64
 5   countyBirths  293021 non-null  float64
 6   stateBirths   321475 non-null  int64
 7   County        321475 non-null  object
dtypes: float64(1), int64(5), object(2)
memory usage: 19.6+ MB

In [44]:
# create a new column 'StateName' by mapping the 'State' column to the state names using the state_dict
birth_data_df['StateName'] = birth_data_df['State'].map(state_dict_new)
display(birth_data_df.head())
display(birth_data_df.tail())

,index,Unnamed: 0,State,Month,Year,countyBirths,stateBirths,County,StateName
0,0,1,1,1,1985,36.0,5027,1001.0,ALABAMA
1,1,2,1,2,1985,36.0,4627,1001.0,ALABAMA
2,2,3,1,3,1985,43.0,4738,1001.0,ALABAMA
3,3,4,1,4,1985,40.0,4626,1001.0,ALABAMA
4,4,5,1,5,1985,34.0,4834,1001.0,ALABAMA

,index,Unnamed: 0,State,Month,Year,countyBirths,stateBirths,County,StateName
321470,321470,321471,55,12,2015,111.0,5632,55131.0,WISCONSIN
321471,321471,321472,55,12,2015,307.0,5632,55133.0,WISCONSIN
321472,321472,321473,55,12,2015,154.0,5632,55139.0,WISCONSIN
321473,321473,321474,55,12,2015,1848.0,5632,55999.0,WISCONSIN
321474,321474,321475,56,12,2015,661.0,661,56999.0,WYOMING

In [45]:
#delete Unnamed: 0 column and the index column
birth_data_df.drop(columns=['Unnamed: 0'], inplace=True)
display(birth_data_df.head())

   index State  Month  Year  countyBirths  stateBirths  County StateName
0      0     1      1  1985          36.0         5027  1001.0   ALABAMA
1      1     1      2  1985          36.0         4627  1001.0   ALABAMA
2      2     1      3  1985          43.0         4738  1001.0   ALABAMA
3      3     1      4  1985          40.0         4626  1001.0   ALABAMA
4      4     1      5  1985          34.0         4834  1001.0   ALABAMA

In [46]:
# Drop columns County and countyBirths
birth_data_df.drop(columns=['County', 'countyBirths'], inplace=True)

In [47]:
# select data from 1992 onwards only
birth_data_df = birth_data_df[birth_data_df['Year'] >= 1992]

In [48]:
# create a dataframe with only the state of Louisiana
la_birth_data_df = birth_data_df[birth_data_df['StateName'] == 'LOUISIANA']
display(la_birth_data_df.head())
la_birth_data_df.info()

         index State  Month  Year  stateBirths  StateName
167789  167789    22      1  1992         6996  LOUISIANA
167790  167790    22      2  1992         6681  LOUISIANA
167791  167791    22      3  1992         7642  LOUISIANA
167792  167792    22      4  1992         7347  LOUISIANA
167793  167793    22      5  1992         7706  LOUISIANA

<class 'pandas.core.frame.DataFrame'>
Index: 3528 entries, 167789 to 321082
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        3528 non-null   int64
 1   State        3528 non-null   object
 2   Month        3528 non-null   int64
 3   Year         3528 non-null   int64
 4   stateBirths  3528 non-null   int64
 5   StateName    3528 non-null   object
dtypes: int64(4), object(2)
memory usage: 192.9+ KB

In [49]:
# create a dataframe with all states except Louisiana
other_states_birth_data_df = birth_data_df[birth_data_df['StateName'] != 'LOUISIANA']
display(other_states_birth_data_df.head())
other_states_birth_data_df.info()

         index State  Month  Year  stateBirths StateName
165665  165665     1      1  1992         5193   ALABAMA
165666  165666     1      2  1992         4792   ALABAMA
165667  165667     1      3  1992         5075   ALABAMA
165668  165668     1      4  1992         4886   ALABAMA
165669  165669     1      5  1992         5037   ALABAMA

<class 'pandas.core.frame.DataFrame'>
Index: 152282 entries, 165665 to 321474
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   index        152282 non-null  int64
 1   State        152282 non-null  object
 2   Month        152282 non-null  int64
 3   Year         152282 non-null  int64
 4   stateBirths  152282 non-null  int64
 5   StateName    146990 non-null  object
dtypes: int64(4), object(2)
memory usage: 8.1+ MB

In [50]:
# reset the index of the dataframes
la_birth_data_df.reset_index(drop=True, inplace=True)
other_states_birth_data_df.reset_index(drop=True, inplace=True)

# drop the index column
la_birth_data_df.drop(columns=['index'], inplace=True)
other_states_birth_data_df.drop(columns=['index'], inplace=True)

# rename the stateBirths column to Births
la_birth_data_df.rename(columns={'stateBirths': 'Births'}, inplace=True)
other_states_birth_data_df.rename(columns={'stateBirths': 'Births'}, inplace=True)

# change the stateName column to title case
la_birth_data_df['StateName'] = la_birth_data_df['StateName'].str.title()
other_states_birth_data_df['StateName'] = other_states_birth_data_df['StateName'].str.title()


la_birth_data_df.head()
other_states_birth_data_df.head()

/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df.drop(columns=['index'], inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df.drop(columns=['index'], inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df.rename(columns={'stateBirths': 'Births'}, inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df.rename(columns={'stateBirths': 'Births'}, inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df['StateName'] = la_birth_data_df['StateName'].str.title()
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/1392396460.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df['StateName'] = other_states_birth_data_df['StateName'].str.title()

  State  Month  Year  Births StateName
0     1      1  1992    5193   Alabama
1     1      2  1992    4792   Alabama
2     1      3  1992    5075   Alabama
3     1      4  1992    4886   Alabama
4     1      5  1992    5037   Alabama

In [51]:
# change the Month column using the Year and Month columns to a datetime object with the day as the first day of the month
la_birth_data_df['Month'] = pd.to_datetime(la_birth_data_df[['Year', 'Month']].assign(day=1))
other_states_birth_data_df['Month'] = pd.to_datetime(other_states_birth_data_df[['Year', 'Month']].assign(day=1))   

la_birth_data_df.head()
other_states_birth_data_df.head()

/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/334453370.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df['Month'] = pd.to_datetime(la_birth_data_df[['Year', 'Month']].assign(day=1))
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/334453370.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df['Month'] = pd.to_datetime(other_states_birth_data_df[['Year', 'Month']].assign(day=1))

  State      Month  Year  Births StateName
0     1 1992-01-01  1992    5193   Alabama
1     1 1992-02-01  1992    4792   Alabama
2     1 1992-03-01  1992    5075   Alabama
3     1 1992-04-01  1992    4886   Alabama
4     1 1992-05-01  1992    5037   Alabama

In [52]:
# drop the State and StateName Columns from the dataframes

la_birth_data_df.drop(columns=['State', 'StateName'], inplace=True)
other_states_birth_data_df.drop(columns=['State', 'StateName'], inplace=True)

# rename Births column to LA_Births in the la_birth_data_df
la_birth_data_df.rename(columns={'Births': 'LA_Births'}, inplace=True)

#rename the Births column to OtherStates_Births in the other_states_birth_data_df
other_states_birth_data_df.rename(columns={'Births': 'OtherStates_Births'}, inplace=True)

display(la_birth_data_df.head())
display(other_states_birth_data_df.head())

/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/2476389187.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df.drop(columns=['State', 'StateName'], inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/2476389187.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df.drop(columns=['State', 'StateName'], inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/2476389187.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  la_birth_data_df.rename(columns={'Births': 'LA_Births'}, inplace=True)
/var/folders/b_/hfr4p_vs0nq_qyzqdx8n584m0000gn/T/ipykernel_40341/2476389187.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  other_states_birth_data_df.rename(columns={'Births': 'OtherStates_Births'}, inplace=True)

       Month  Year  LA_Births
0 1992-01-01  1992       6996
1 1992-02-01  1992       6681
2 1992-03-01  1992       7642
3 1992-04-01  1992       7347
4 1992-05-01  1992       7706

       Month  Year  OtherStates_Births
0 1992-01-01  1992                5193
1 1992-02-01  1992                4792
2 1992-03-01  1992                5075
3 1992-04-01  1992                4886
4 1992-05-01  1992                5037

In [53]:
# create a new dataframe with the columns Year, Month, OtherStates_Births where OtherStates_Births is the monthly sum of the births in all states in the other_states_birth_data_df
monthly_other_states_births_df = other_states_birth_data_df.groupby(['Year', 'Month'])['OtherStates_Births'].sum().reset_index()

display(monthly_other_states_births_df.head())
display(monthly_other_states_births_df.info())

   Year      Month  OtherStates_Births
0  1992 1992-01-01             5691405
1  1992 1992-02-01             5383412
2  1992 1992-03-01             5787148
3  1992 1992-04-01             5659697
4  1992 1992-05-01             5837080

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 288 entries, 0 to 287
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                288 non-null    int64
 1   Month               288 non-null    datetime64[ns]
 2   OtherStates_Births  288 non-null    int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 6.9 KB

None

In [54]:
# create a csv file with the la_birth_data_df and monthly_other_states_births_df dataframes
la_birth_data_df.to_csv('resources/LA_Births.csv', index=False)
monthly_other_states_births_df.to_csv('resources/Non_LA_OtherStates_Births.csv', index=False)